#+TITLE: Microservices with Java and Spring Boot
#+PROPERTY: header-args:plantuml :exports results :var _dpi_="150" 
#+options: H:3
#+startup: beamer
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [8pt]
*** Schedule, day 1
|  Time | Duration | Activity                                                  |
|-------+----------+-----------------------------------------------------------|
| 13:00 |    00:10 | Welcome, Outline/Agenda                                   |
| 13:10 |    00:20 | Round table introductions                                 |
| 13:30 |    00:20 | What's a microservice                                     |
| 13:50 |    00:20 | Design for resilience                                     |
|-------+----------+-----------------------------------------------------------|
| 14:10 |    00:20 | Break(out) 1: Identify services & resilience (or lack of) |
|-------+----------+-----------------------------------------------------------|
| 14:30 |    00:15 | Round table identified services exchange                  |
| 14:45 |    00:45 | Infrastructure architecture                               |
|-------+----------+-----------------------------------------------------------|
| 15:30 |    00:20 | Break(out) 2: Checkout, install and run demo-project      |
|-------+----------+-----------------------------------------------------------|
| 15:50 |    00:30 | Data architecture                                         |
| 16:20 |    00:10 | Security architecture                                     |
| 16:30 |    00:30 | Software architecture                                     |
| 17:00 |    00:15 | GUIDE: Introduction, API, Metrics                         |
|-------+----------+-----------------------------------------------------------|
| 17:15 |    00:55 | Break(out) 3: Food (?), Extend demo-project with (???)    |
|-------+----------+-----------------------------------------------------------|
| 18:10 |    00:30 | Presentation(s) of extended demo project                  |
| 18:40 |    00:20 | Homework, Wrap-up, reserved time for extra subjects       |
|-------+----------+-----------------------------------------------------------|
#+TBLFM: @3$1..@>$1=@-1$2+@-1$1;U

*** Lambdas (Java 8+)
- A /lambda/ is an anonymous function body
- You can write them anywhere a /Functional Interface/ is expected, e.g.
#+BEGIN_SRC java  :classname LambdaDemo
public class LambdaDemo {
    interface MathOp {
        public int apply(int input);
    }

    static int twice(int input, MathOp op) {
        return op.apply(op.apply(input));
    }

    public static void main(String[] args) {
        int result = twice(10, i -> i + 1);
        System.out.println(result);
    }
}
#+END_SRC

#+RESULTS:
: 12
*** Type-inferred variables (Java 11+)
- Local variables now no longer need a type
- This is especially useful with long generic types
- =var= should be your default in new code

#+BEGIN_SRC java  :classname TypeInferred
import java.util.function.Function;

public class TypeInferred {

    static <T> Function<T,T> twice(Function<T,T> fun) {
        return t -> fun.apply(fun.apply(t));
    }
    
    public static void main(String[] args) {
        var twiceAddOne = twice((Integer i) -> i + 1);
        int result = twiceAddOne.apply(10);
        System.out.println(result);
    }
}
#+END_SRC

#+RESULTS:
: 12

*** Records (Java 14+)

#+BEGIN_SRC java  :classname Rectangle :results scalar
public record Rectangle(float length, float width) {
    public Rectangle {
        System.out.println("This is a compact constructor.");
    }

    public static void main(String[] args) {
        var r = new Rectangle(5, 3);
        System.out.println(r);
    }
}
#+END_SRC

#+RESULTS:
: This is a compact constructor.
: Rectangle[length=5.0, width=3.0]

- A =record= is an immutable value type
  * Each argument is a private, final field
  * Getter for each argument with the same name
  * Constructor with all arguments (can have extra code as shown)
  * Appropriate =equals=, =hashCode= and =toString=

- Ideal for data classes, and perhaps domain model
- Expect JSON and XML code generators to pick these up
  * JOOQ was [[https://github.com/jOOQ/jOOQ/issues/10287][recently]] updated with =record= support for POJOs (for 3.15.0)
*** Schedule, Day 2
|  Time | Duration | Activity                                     |
|-------+----------+----------------------------------------------|
| 13:00 |    00:10 | Welcome, Outline/Agenda                      |
| 13:10 |    00:40 | Homework presentations (6 teams, 5 min each) |
| 13:50 |    00:10 | Recap of day 1                               |
|-------+----------+----------------------------------------------|
| 14:00 |    00:05 | Break                                        |
|-------+----------+----------------------------------------------|
| 14:05 |    00:30 | Strategy and team dynamics                   |
| 14:35 |    00:30 | Getting your service used                    |
| 15:05 |          |                                              |
#+TBLFM: @3$1..@>$1=@-1$2+@-1$1;U


